#### Importing libraries

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#### Loading data

In [65]:
df = pd.read_csv('house_price.csv')
df.head()

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1.850000e+09,61666.67
1,60,1,True,True,True,Shahran,1.850000e+09,61666.67
2,79,2,True,True,True,Pardis,5.500000e+08,18333.33
3,95,2,True,True,True,Shahrake Qods,9.025000e+08,30083.33
4,123,2,True,True,True,Shahrake Gharb,7.000000e+09,233333.33

#### Dealing with missing data

In [12]:
df.dropna(axis=0, inplace=True)